<template>
  <div class = "container-fluid ots" style = "margin-top: 50px">
    <div class = "text-center">
      <h1>Отзывы</h1>
    </div>
    <div class = "slider">
      <div class = "item">
        <img src = "../assets/img/slider/1.jpg" class = "item1" alt = "">
        <p class = "text1">Долгие поиски единственного и неповторимого мастера на
          многострадальный сайт www.cielparfum.com, который был собран
          крайне некомпетентным программистом и паз в месяц стабильно
          грозил погибнуть, привели меня на сайт и, в итоге, к ребятам
          из Drupal-coder. И вот практически уже полгода как не проходит
         и дня, чтобы я не поудивлялась и не порадовалась своему везению!
        Починили всё, что не работало - от поиска, до отображения меню.
        Провели редизайн - не отходя от желаемого, но со своими существенными
        и качественными дополнениями. Осуществили ряд проектов - конкурсы,
        тесты, и т.д. А уже мелких починок и доработок - не счесть! И главное
        - всё качественно и быстро (не взирая на "не самый быстрый тариф").
        Есть вопросы - замечательный Алексей всегда подскажет, поддержит,
        отремонтирует и/или просто сделает с нуля. Есть задумка для реализации
         - замечательный Сергей обсудит и предложит идеальный вариант. Есть
        проблема - замечательные Надежда и Роман починят, поправят, сделают!
        Ребята доказали, что эта CMS - мощная и грамотная система управления.
        Надеюсь, что наше сотрудничество затянется надолго! Спасибо!!!</p>
        <p class = "text2">С уважением, Наталья Сушкова руководитель отдела веб-проектов
        Группы компаний "Си Эль парфюм"</p>
      </div>
      <div class = "item">
        <img src = "../assets/img/slider/12.png" class = "item1" alt = "">
        <p class = "text1">Долгие поиски единственного и неповторимого мастера на
          многострадальный сайт www.cielparfum.com, который был собран
          крайне некомпетентным программистом и паз в месяц стабильно
          грозил погибнуть, привели меня на сайт и, в итоге, к ребятам
          из Drupal-coder. И вот практически уже полгода как не проходит
          и дня, чтобы я не поудивлялась и не порадовалась своему везению!
          Починили всё, что не работало - от поиска, до отображения меню.
          Провели редизайн - не отходя от желаемого, но со своими существенными
          и качественными дополнениями. Осуществили ряд проектов - конкурсы,
          тесты, и т.д. А уже мелких починок и доработок - не счесть! И главное
          - всё качественно и быстро (не взирая на "не самый быстрый тариф").
          Есть вопросы - замечательный Алексей всегда подскажет, поддержит,
          отремонтирует и/или просто сделает с нуля. Есть задумка для реализации
          - замечательный Сергей обсудит и предложит идеальный вариант. Есть
          проблема - замечательные Надежда и Роман починят, поправят, сделают!
          Ребята доказали, что эта CMS - мощная и грамотная система управления.
          Надеюсь, что наше сотрудничество затянется надолго! Спасибо!!!</p>
        <p class = "text2">С уважением, Наталья Сушкова руководитель отдела веб-проектов
          Группы компаний "Си Эль парфюм"</p>
      </div>
      <div class = "item">
        <img src = "../assets/img/slider/2.jpg" class = "item1" alt = "">
        <p class = "text1">Долгие поиски единственного и неповторимого мастера на
          многострадальный сайт www.cielparfum.com, который был собран
          крайне некомпетентным программистом и паз в месяц стабильно
          грозил погибнуть, привели меня на сайт и, в итоге, к ребятам
          из Drupal-coder. И вот практически уже полгода как не проходит
          и дня, чтобы я не поудивлялась и не порадовалась своему везению!
          Починили всё, что не работало - от поиска, до отображения меню.
          Провели редизайн - не отходя от желаемого, но со своими существенными
          и качественными дополнениями. Осуществили ряд проектов - конкурсы,
          тесты, и т.д. А уже мелких починок и доработок - не счесть! И главное
          - всё качественно и быстро (не взирая на "не самый быстрый тариф").
          Есть вопросы - замечательный Алексей всегда подскажет, поддержит,
          отремонтирует и/или просто сделает с нуля. Есть задумка для реализации
          - замечательный Сергей обсудит и предложит идеальный вариант. Есть
          проблема - замечательные Надежда и Роман починят, поправят, сделают!
          Ребята доказали, что эта CMS - мощная и грамотная система управления.
          Надеюсь, что наше сотрудничество затянется надолго! Спасибо!!!</p>
        <p class = "text2">С уважением, Наталья Сушкова руководитель отдела веб-проектов
          Группы компаний "Си Эль парфюм"</p>
      </div>
      <div class = "item">
        <img src = "../assets/img/slider/3.jpg" class = "item1" alt = "">
        <p class = "text1">Долгие поиски единственного и неповторимого мастера на
          многострадальный сайт www.cielparfum.com, который был собран
          крайне некомпетентным программистом и паз в месяц стабильно
          грозил погибнуть, привели меня на сайт и, в итоге, к ребятам
          из Drupal-coder. И вот практически уже полгода как не проходит
          и дня, чтобы я не поудивлялась и не порадовалась своему везению!
          Починили всё, что не работало - от поиска, до отображения меню.
          Провели редизайн - не отходя от желаемого, но со своими существенными
          и качественными дополнениями. Осуществили ряд проектов - конкурсы,
          тесты, и т.д. А уже мелких починок и доработок - не счесть! И главное
          - всё качественно и быстро (не взирая на "не самый быстрый тариф").
          Есть вопросы - замечательный Алексей всегда подскажет, поддержит,
          отремонтирует и/или просто сделает с нуля. Есть задумка для реализации
          - замечательный Сергей обсудит и предложит идеальный вариант. Есть
          проблема - замечательные Надежда и Роман починят, поправят, сделают!
          Ребята доказали, что эта CMS - мощная и грамотная система управления.
          Надеюсь, что наше сотрудничество затянется надолго! Спасибо!!!</p>
        <p class = "text2">С уважением, Наталья Сушкова руководитель отдела веб-проектов
          Группы компаний "Си Эль парфюм"</p>
      </div>
      <div class = "item">
        <img src = "../assets/img/slider/4.png" class = "item1" alt = "">
        <p class = "text1">Долгие поиски единственного и неповторимого мастера на
          многострадальный сайт www.cielparfum.com, который был собран
          крайне некомпетентным программистом и паз в месяц стабильно
          грозил погибнуть, привели меня на сайт и, в итоге, к ребятам
          из Drupal-coder. И вот практически уже полгода как не проходит
          и дня, чтобы я не поудивлялась и не порадовалась своему везению!
          Починили всё, что не работало - от поиска, до отображения меню.
          Провели редизайн - не отходя от желаемого, но со своими существенными
          и качественными дополнениями. Осуществили ряд проектов - конкурсы,
          тесты, и т.д. А уже мелких починок и доработок - не счесть! И главное
          - всё качественно и быстро (не взирая на "не самый быстрый тариф").
          Есть вопросы - замечательный Алексей всегда подскажет, поддержит,
          отремонтирует и/или просто сделает с нуля. Есть задумка для реализации
          - замечательный Сергей обсудит и предложит идеальный вариант. Есть
          проблема - замечательные Надежда и Роман починят, поправят, сделают!
          Ребята доказали, что эта CMS - мощная и грамотная система управления.
          Надеюсь, что наше сотрудничество затянется надолго! Спасибо!!!</p>
        <p class = "text2">С уважением, Наталья Сушкова руководитель отдела веб-проектов
          Группы компаний "Си Эль парфюм"</p>
      </div>
      <div class = "item">
        <img src = "../assets/img/slider/6.png" class = "item1" alt = "">
        <p class = "text1">Долгие поиски единственного и неповторимого мастера на
          многострадальный сайт www.cielparfum.com, который был собран
          крайне некомпетентным программистом и паз в месяц стабильно
          грозил погибнуть, привели меня на сайт и, в итоге, к ребятам
          из Drupal-coder. И вот практически уже полгода как не проходит
          и дня, чтобы я не поудивлялась и не порадовалась своему везению!
          Починили всё, что не работало - от поиска, до отображения меню.
          Провели редизайн - не отходя от желаемого, но со своими существенными
          и качественными дополнениями. Осуществили ряд проектов - конкурсы,
          тесты, и т.д. А уже мелких починок и доработок - не счесть! И главное
          - всё качественно и быстро (не взирая на "не самый быстрый тариф").
          Есть вопросы - замечательный Алексей всегда подскажет, поддержит,
          отремонтирует и/или просто сделает с нуля. Есть задумка для реализации
          - замечательный Сергей обсудит и предложит идеальный вариант. Есть
          проблема - замечательные Надежда и Роман починят, поправят, сделают!
          Ребята доказали, что эта CMS - мощная и грамотная система управления.
          Надеюсь, что наше сотрудничество затянется надолго! Спасибо!!!</p>
        <p class = "text2">С уважением, Наталья Сушкова руководитель отдела веб-проектов
          Группы компаний "Си Эль парфюм"</p>
      </div>
      <div class = "item">
        <img src = "../assets/img/slider/5.png" class = "item1" alt = "">
        <p class = "text1">Долгие поиски единственного и неповторимого мастера на
          многострадальный сайт www.cielparfum.com, который был собран
          крайне некомпетентным программистом и паз в месяц стабильно
          грозил погибнуть, привели меня на сайт и, в итоге, к ребятам
          из Drupal-coder. И вот практически уже полгода как не проходит
          и дня, чтобы я не поудивлялась и не порадовалась своему везению!
          Починили всё, что не работало - от поиска, до отображения меню.
          Провели редизайн - не отходя от желаемого, но со своими существенными
          и качественными дополнениями. Осуществили ряд проектов - конкурсы,
          тесты, и т.д. А уже мелких починок и доработок - не счесть! И главное
          - всё качественно и быстро (не взирая на "не самый быстрый тариф").
          Есть вопросы - замечательный Алексей всегда подскажет, поддержит,
          отремонтирует и/или просто сделает с нуля. Есть задумка для реализации
          - замечательный Сергей обсудит и предложит идеальный вариант. Есть
          проблема - замечательные Надежда и Роман починят, поправят, сделают!
          Ребята доказали, что эта CMS - мощная и грамотная система управления.
          Надеюсь, что наше сотрудничество затянется надолго! Спасибо!!!</p>
        <p class = "text2">С уважением, Наталья Сушкова руководитель отдела веб-проектов
          Группы компаний "Си Эль парфюм"</p>
      </div>
      <div class = "item">
        <img src = "../assets/img/slider/10.png" class = "item1" alt = "">
        <p class = "text1">Долгие поиски единственного и неповторимого мастера на
          многострадальный сайт www.cielparfum.com, который был собран
          крайне некомпетентным программистом и паз в месяц стабильно
          грозил погибнуть, привели меня на сайт и, в итоге, к ребятам
          из Drupal-coder. И вот практически уже полгода как не проходит
          и дня, чтобы я не поудивлялась и не порадовалась своему везению!
          Починили всё, что не работало - от поиска, до отображения меню.
          Провели редизайн - не отходя от желаемого, но со своими существенными
          и качественными дополнениями. Осуществили ряд проектов - конкурсы,
          тесты, и т.д. А уже мелких починок и доработок - не счесть! И главное
          - всё качественно и быстро (не взирая на "не самый быстрый тариф").
          Есть вопросы - замечательный Алексей всегда подскажет, поддержит,
          отремонтирует и/или просто сделает с нуля. Есть задумка для реализации
          - замечательный Сергей обсудит и предложит идеальный вариант. Есть
          проблема - замечательные Надежда и Роман починят, поправят, сделают!
          Ребята доказали, что эта CMS - мощная и грамотная система управления.
          Надеюсь, что наше сотрудничество затянется надолго! Спасибо!!!</p>
        <p class = "text2">С уважением, Наталья Сушкова руководитель отдела веб-проектов
          Группы компаний "Си Эль парфюм"</p>
      </div>
      <a class = "previous" onclick = "previousSlide()">&#10094;</a>
      <a class = "next" onclick = "nextSlide()">&#10095;</a>
    </div>
  </div>
</template>

<script>
  export default {
    name: "SliderApp"
  }

  /*let slideIndex = 1;
  showSlides(slideIndex);
  function nextSlide() {
    showSlides(slideIndex += 1);
  }
  function previousSlide() {
    showSlides(slideIndex -= 1);
  }
  function currentSlide(n) {
    showSlides(slideIndex = n);
  }
  function showSlides(n) {
    let slides = document.getElementsByClassName("item");
    if (n > slides.length)
      slideIndex = 1;
    if (n < 1)
      slideIndex = slides.length;
    for (let slide of slides)
      slide.style.display = "none";
    slides[slideIndex - 1].style.display = "block";
  }*/
</script>

<style scoped>

@media (max-width: 1280px)
{
  .ots
  {
    margin-bottom: 3000px;
  }
}

@media (max-width: 1024px)
{
  .ots
  {
    margin-bottom: 3500px;
  }
}

@media (max-width: 912px)
{
  .ots
  {
    margin-bottom: 4100px;
  }
}

@media (max-width: 820px)
{
  .ots
  {
    margin-bottom: 4100px;
  }
}

@media (max-width: 768px)
{
  .ots
  {
    margin-bottom: 4200px;
  }
}

@media (max-width: 600px)
{
  .ots
  {
    margin-bottom: 5200px;
  }
}

@media (max-width: 540px)
{
  .ots
  {
    margin-bottom: 5800px;
  }
}

@media (max-width: 420px)
{
  .ots
  {
    margin-bottom: 7700px;
  }
}

@media (max-width: 393px)
{
  .ots
  {
    margin-bottom: 7900px;
  }
}

@media (max-width: 375px)
{
  .ots
  {
    margin-bottom: 8500px;
  }
}

@media (max-width: 280px)
{
  .ots
  {
    margin-bottom: 11500px;
  }
}

  .item1
  {
    width: 100px;
    height: 100px;
  }

  .text1
  {
    font-weight: bold;
  }

  .text2
  {
    color: #292b2c;
  }

  .slider
  {
    max-width: 90%;
    position: relative;
    margin: auto;
    height: 300px;
  }

  /*.slider .item img
  {
    object-fit: cover;
    width: 100%;
    height: 300px;
  }*/

  .slider .previous, .slider .next
  {
    cursor: pointer;
    position: absolute;
    top: 50%;
    width: auto;
    margin-top: -22px;
    padding: 16px;
    color: white;
    font-weight: bold;
    font-size: 16px;
    transition: 0.6s ease;
    border-radius: 0 3px 3px 0;
  }

  .slider .next
  {
    right: 0;
    border-radius: 3px 0 0 3px;
  }

  .slider .previous:hover, .slider .next:hover
  {
    background-color: rgba(0, 0, 0, 0.2);
  }

  .slider .item
  {
    animation-name: fade;
    animation-duration: 1.5s;
  }

  @keyframes fade
  {
    from {opacity: 0.4}
    to {opacity: 1}
  }
</style>